'''
==========================
Module (모듈): 함수, 변수, 클래스를 모아 놓은 파일
==========================
'''

#================================================
# import 모듈이름


# from 모듈이름 import 모듈함수


from module1 import* # 모든 함수 불러오기


##====================================
## if__name__=="__main__": 의 의미
##====================================

# module2.py 파일======================== 
#def add(a,b):
#    return a+b
#def sub(a,b):
#    return a-b
#print(add(1,4))
#print(add(4,2))
# =======================================



#============================================================
# 이를 방지하기 위해 if__name__=="__main__": 사용
# __name__=="__main__": 현재 파일이 엔트리 포인트인지 확인할 때 사용하는 코드
# 엔트리 포인트(entry point) 또는 메인: 프로그램의 진입점
#===========================================================




#===============================
# 클래스나 변수를 포함한 모듈
#===============================



