'''
====================================
반복문: for 문
====================================
'''
#========================
# for 문 + list
#========================
test_list = ['a','b','c']
for i in test_list:
    print(i)

test_list2 = [1,3,5, 7,9]
for i in test_list2:
    print(i)
    
a = [(1,2), (3,4), (5,6)]
for (first, last) in a:
    print(first+last)

# Exercise: ======================
#(1) 
numbers = [123, 104, 4, 17, 87, 800, 99]


#(2) 
numbers = [123, 104, 4, 17, 87,800, 99]
num=0


#(3) 

#================================

# 예제 1
marks = [90, 25, 67, 45, 80]
number = 0

# 출력결과: *번 학생은 (불)합격입니다.
        

# 예제 2
marks = [90, 25, 67, 45, 80]
number = 0

# 출력결과: *번 학생 축하합니다. 합격입니다.


#========================
# for 문 + dictionary
#========================

# 예제 
numbers = [1, 2, 6, 8, 4, 3, 2, 1, 9, 5 ,4, 9, 7, 4, 8,9,7,2,3]
counter={}
     
print(counter)
# 출력결과: {1: 2, 2: 3, 6: 1, 8: 2, 4: 3, 3: 2, 9: 3, 5: 1, 7: 2}


#====================================
# range + for 문
#====================================
a= range(10) # 0,1,2,...,9
a=range(1,11) # 1,2,...,10
a=range(1,11, 2) # 1,3,5,7,9

# 예제
for i in range(11):
    print(i)

for i in reversed(range(11)):
    print(i)

# 예제: 숫자더하기 



# 앞의 예제 
marks = [90, 25, 67, 45, 80]


# 예제:  한줄에 결괏값 출력



# 예제: 구구단 출력하기
for k in range(2,10):
    for j in range(1, 10):
        print('%d X %d = %d' %(k, j, k*j))

line = ''
for k in range(2,10):
    line = line + ('#   %d단   # '%k)
print(line)



# 예제: dictionary
Keys = ['name', 'hp', 'mp', 'level']
values = ['기사', 200, 30, 5]
character = {} # dictionary

#출력결과: {'name': '기사', 'hp': 200, 'mp':30, 'level':5)

    
#=====================================
# 리스트 내포 사용하기
#=====================================
a = [1,2,3,4]
result = [];
for num in a:
    result.append(num*3)
print(result)

# 리스트 내포(list comprehension)



## Exercise=================================================

#1. 10명의 학생들의 중간고사 점수는 [70, 60,55,75, 95,90,80,80,85,100]이다. 

#2.

#3. 
        
#4.

        
