'''
========================
내장함수
========================
'''
# abs
abs(-3)

# all, any: 리스트*튜플*딕셔너리*집합*문자열
all([1,2,3]) #true
all([1,2,0]) #false

any([1,2,3,0]) #true
any([0, ""]) # false

# divmod => (a,b): 몫과 나머지 
x, y = divmod(7, 3) # (2,1)
print(x,y)

## enumerate: 자료형의 현재 순서와 그 값


    
## eval(expression): 실행 가능한 문자열을 받아 문자열을 실행한 결괏값을 돌려주는 함수




# list
list("python")
list((1,2,3)) 
list(range(5))
list(range(5,10)) 
list(range(1,10,2)) 
list(range(0,-10,-1))

# tuple
tuple("abc") 
tuple([1,2,3]) 


# round: 반올림
round(4.6) 
round(4.2) 
round(5.678, 2) 

# sorted(리스트,문자열,튜플) => list로 반환
sorted([3,1,2])
sorted(['a','c','b']) 
sorted("zero") 
sorted((3,2,1))

# sum(iterable)
sum([1,2,3]) 
sum((1,2,3)) 


## filter(함수이름, 함수에 들어갈 반복가능한 자료형)====================
# 두번째 인수가 함수에 입력되었을 때 반환 값이  참인 것만 묶어서 돌려줌 


# filter 이용하여 간단하게 변경


# lambda 사용하여 변경

#======================================================================

## Exercise ============================================================



## map(f, iterable): f=함수, iterable=반복가능한 자료형=================
# 입력받은 자료형의 각 요소를 함수 f가 수행한 결과를 묶어서 돌려줌 


# map 이용하여 간단하게 변경

# =======================================================================

## Exercise ============================================================


